// Гарт Анна Вікторівна, група ПС-24-1, білет №4, завдання №2

#include <stdio.h> 
#include <stdlib.h> 
#include <math.h>

int main() { 
    double a, b, x, y;

    system("chcp 65001");
    system("cls");

    printf ("\nОбчислення значення функції\n\n"); 

    printf ("       { sin(x),           при x є (-oo; -2)      (1)\n");
    printf ("f(x) = { 2e^ax - 1,        при x = -2             (2)\n");
    printf ("       { (bx + 2a)^(-2),   при x є (-2; 8)        (3)\n\n");
     
    printf ("Введіть параметри a, b: "); 
    scanf_s ("%lf%lf", &a, &b); 
    printf ("Введіть значення x: "); 
    scanf_s("%lf", &x);  

    // Розгалуження (1)
    if (x < -2) {
        printf ("\nОбчислення за розгалуженням (1):\n");
        y = sin(x);
        printf("f(%4.2f) = sin(%4.2f) = %6.4f\n", x, x, y);
    } 
    // Розгалуження (2)
    else if (x == -2) {
        printf ("\nОбчислення за розгалуженням (2):\n");
        y = 2*exp(a*x) - 1;
        printf("f(-2) = 2e^(%4.2f)*(-2) - 1 = 2e^(%4.2f) - 1 = 2 * (%6.4f) - 1 = %6.4f\n", a, a*x, exp(a*x), y);
    } 
    // Розгалуження (3)
    else if (x > -2 && x < 8) {
        printf ("\nОбчислення за розгалуженням (3):\n");
        y = pow((b*x + 2*a), -2);
        if ((b*x + 2*a) != 0) {
            printf("f(%4.2f) = ( (%4.2f)*(%4.2f) + 2*(%4.2f) )^(-2) = ( (%4.2f) + (%4.2f) )^(-2) = (%4.2f)^(-2) = %6.4f\n", x, b, x, a, b*x, 2*a, b*x+2*a, y);
        }
        else {
            printf("За параметрів a = %4.2f, b = %4.2f функція f(x) у точці x = %4.2f набуває значення 1/0. Отже\n", a, b, x);
            printf("f(%4.2f) = ( (%4.2f)*(%4.2f) + 2*(%4.2f) )^(-2) = ( (%4.2f) + (%4.2f) )^(-2) = (%4.2f)^(-2) = %6.4f\n", x, b, x, a, b*x, 2*a, b*x+2*a, y);
        }
    }  
    else { 
        printf ("\nФункція f(x) не визначена у точці x = %4.2f", x);
    } 

    printf ("\n\n");
    system("pause"); 
    return 0; 
} 