/* Гарт Анна Вікторівна, група ПС-24-1, варіант №4
 * Завдання №2. Оформлення звітів засобами текстового редактора Word */

#include <iostream>
#include <stdio.h> // підмикання бібліотеки stdio.h; y програмі використано функцію printf()
#include <stdlib.h> // підмикання бібліотеки stdlib.h; y програмі використано функцію system()

// За введеним користувачем числовим кодом від 32 до 255 (кодування ASCII) програма виводить символ

int main() {

    int kod; // код символа; символи з кодами 0-31 є службовими; пробіл має код 32 */

    system("chcp 65001"); // для відображення кирилиці в MS Windows
    system("cls");

    printf("Введіть ASCІІ-код символа від 32 до 255\n");
    scanf("%d",&kod);

    if(kod<32 || kod>255) {
        printf("неправильний код\n");
    } else {
        printf("символ %c\n",kod);
    }

    system("pause"); // затримка екрана
    return 0;
}