/* Гарт Анна Вікторівна, група ПС-24-1, варіант №4
 * Практична робота №3. Програмування обчислювальних алгоритмів лінійної структури */

#include <iostream>
#include <stdio.h>
#include <stdlib.h>
#include <math.h>

/* Програма обчислює три функції: 
   f1 = sqrt((x+2)/(2-a*x))+4*|log2(x)-1|
   f2 = 5/4*pow(x, 2) + 3/10*x - 2*exp(3*tan(x)+5)
   f3 = 2/5*pow(x, 2.6)
   Виконує переприсвоєння змінних: y → z, z → t, t → y */ 

int main() {

    double a, x;          // вхідні дані 
    double y, z, t;       // результати обчислення функцій 
    double temp;          // допоміжна змінна для перестановки

    system("chcp 65001");
    system("cls");

    printf("Введіть параметр a i змінну x: "); 
    scanf("%lf  %lf", &a, &x);

    //обчислення функцій
    if (x>1) {
        y = sqrt((x+2)/(2-a*x))+4*(log2(x)-1);}
    else {
        y = sqrt((x+2)/(2-a*x))+4*(1-log2(x));}                 //f1
    z = (5.0/4.0)*pow(x, 2) + (3.0/10.0)*x - 2*exp(3*tan(x)+5); //f2
    t = (2.0/5.0)*pow(x, 2.6);                                  //f3

        // вивід результатів 

    printf("Результати обчислень:\n"); 
    printf("  y = %.3f\n  z = %.3f\n  t = %.3f\n", y, z, t); 

    // переприсвоєння: y → z, z → t, t → y 

    temp = y; 
    y = z; 
    z = t; 
    t = temp; 

    // Вивід нових значень 

    printf("\nПісля переприсвоєння:\n"); 
    printf("  y = %.3f\n  z = %.3f\n  t = %.3f\n", y, z, t);         

    system("pause");
    return 0;
}